[{"description":"At Northern Data, we provide globally significant GPU solutions through the development and operation of an efficient and environmentally-friendly High Performance Computing (HPC) infrastructure. Within our customized data centers, we combine sustainability, mobile high-performance, and location flexibility with advanced hardware and in-house, proprietary software for various HPC applications.","email":"","email_name":"","logo":null,"name":"Northern Data","social media":"[Twitter](https://twitter.com/NorthernDataAG)<br/>\n[LinkedIn](https://www.linkedin.com/company/northerndataag/)\n","status":"platinum+banquet","url":"https://northerndata.eu/en/hpc/cloud-services"},{"description":"Tableau helps people see and understand data. As the world's leading analytics platform, Tableau offers visual analytics with powerful AI, data management and collaboration. From individuals to organizations of all sizes, customers around the world love using Tableau's advanced analytics to fuel impactful, data-driven decisions.","email":"https://www.tableau.com/about/contact#contact_general-inquiry","email_name":"General Inquiry","logo":"","name":"Tableau","social media":"[LinkedIn](https://www.linkedin.com/company/tableau-software)<br/>\n[Twitter](https://www.twitter.com/tableau)<br/>\n[YouTube](https://www.youtube.com/c/tableausoftware/videos)<br/>\n[Facebook](https://www.facebook.com/Tableau/)\n","status":"platinum","url":"https://www.tableau.com/"},{"description":"Autodesk is a global leader in design and make technology. With expertise across architecture, engineering, construction, design, manufacturing, and entertainment, we help innovators everywhere solve today's pressing challenges. Our mission is to empower innovators with ingenuity and the right tools to work and think flexibly so they can achieve the new possible and to design and make a better world for all.\n\nAutodesk Research furthers this mission with explorations in several key areas such as Human-Computer Interaction and Visualization; Architecture, Engineering, and Construction; Artificial Intelligence; and Industry and Manufacturing Futures. Our HCI & Vis team focuses on how to develop a fundamental understanding of how humans perceive, learn, and interact with technology, through rigorous scientific study, collaborations with leading academic institutions and research partnerships with selected lighthouse customers. Based on these understandings we develop novel interfaces and visualizations to solve current problems and explore future opportunities.\n\n![An Autodesk application on a computer screen](https://ieeevis.b-cdn.net/vis_2022/booth_data/autodesk-booth-image.png)\n","email":"","email_name":"","logo":"","name":"Autodesk","social media":"[Facebook](https://www.facebook.com/autodesk/)<br/>\n[YouTube](https://www.youtube.com/channel/UCRnX4Yc585eRTj4UvNkBM8w)<br/>\n[Twitter](https://twitter.com/autodesk)<br/>\n[LinkedIn](https://www.linkedin.com/company/1879/)","status":"silver","url":"https://www.autodesk.com"},{"description":"Visual Computing is the science of sensing, modeling, simulating, processing, understanding, visualizing, and displaying all forms of visual information. Over the past decades, Visual Computing has become a key enabling technology for a diverse set of applications spanning scientific discovery, medicine, consumer electronics, and entertainment, to name just a few.\n\nTo solve problems in this vast space, the Visual Computing Center at KAUST draws from expertise in multiple disciplines, including Computer Science, Electrical Engineering, Mechanical Engineering, and Applied Mathematics, as well as a range of application domains. This interdisciplinary view allows for a pipeline approach including device development (e.g. computational cameras and displays), image and video understanding and semantic analysis, geometric modeling and understanding, simulation, and visualization. By considering this whole pipeline, more effective solutions can be found for problems in the mentioned application domains.\n","email":"mailto:ivan.viola@kaust.edu.sa","email_name":"Prof. Ivan Viola","logo":"","name":"KAUST VCC","social media":"","status":"silver","url":"https://cemse.kaust.edu.sa/vcc"},{"description":"The University of Oklahoma is a comprehensive research university classified by the Carnegie Foundation in the highest tier of research universities in the nation. Our research enterprise features award-winning and nationally and internationally recognized faculty, multidisciplinary research centers, scholarly publications, and acclaimed performances at venues throughout the world.\n\n![University of Oklahoma logo](https://ieeevis.b-cdn.net/vis_2022/booth_data/ok-booth-image.png)\n","email":"mailto:esearchnews@ou.edu","email_name":"OU email","logo":"","name":"University of Oklahoma","social media":"[DISC Facebook](https://www.facebook.com/ouvpr)<br/>\n[LinkedIn](https://www.linkedin.com/company/ou-research)<br/>\n[Twitter](https://twitter.com/OUResearch)","status":"silver","url":"https://ou.edu/research"},{"description":"We're the only dedicated IT faculty out of the prestigious [Group of Eight](https://go8.edu.au/). So you can be sure that technology is everything we do. Guided by our ethos '[IT for social good](https://www.monash.edu/it/research/social-good-projects)', we're also active champions of equity, diversity and inclusion, and constantly seeking new ways to support Indigenous Australians.\n\n![Monash University logo](https://ieeevis.b-cdn.net/vis_2022/booth_data/monash-booth-image.png)\n","email":"","email_name":"","logo":"","name":"Monash University","social media":"[LinkedIn](https://www.linkedin.com/company/monash-information-technology)<br/>\n[Twitter](https://twitter.com/MonashInfotech)<br/>\n[Facebook](https://www.facebook.com/MonashInfoTech)","status":"bronze","url":"https://www.monash.edu/it"},{"description":"The Data Institute for Societal Challenges (DISC) is an interdisciplinary center that coordinates and fosters research in data science, machine learning, artificial intelligence, and data-enabled science across the University of Oklahoma. The center is a hub that brings together experts in various research disciplines to solve societal challenges. \n\n[DISC One Page Flyer](https://ieeevis.b-cdn.net/vis_2022/booth_data/DISC_One-Pager Flyer.pdf)\n\n[DISC Strategic Plan](https://ieeevis.b-cdn.net/vis_2022/booth_data/FINAL-DISC-Strategic-Plan.pdf)\n\n[DISC at VIS 2022](https://ieeevis.b-cdn.net/vis_2022/booth_data/disc-vis-2022-slide.pdf)\n\n![DISC logo](https://ieeevis.b-cdn.net/vis_2022/booth_data/disc-logo-squared-600w.png)\n","email":"mailto:disc@ou.edu","email_name":"DISC","logo":"","name":"University of Oklahoma Data Institute for Societal Challenges","social media":"[DISC Facebook](https://www.facebook.com/DISCatOU/)<br/>\n[VPRP LinkedIn](https://www.linkedin.com/company/ou-research/)<br/>\n[VPRP Twitter](https://twitter.com/ouresearch?lang=en)<br/>\n[VRPR YouTube](https://www.youtube.com/channel/UC22UZGIwvqzjfWSjhKvLYhQ)\n","status":"bronze","url":"https://ou.edu/disc"}]
