[{"Award":"IEEE VAST Test of Time Award 2024","DOI":"https://doi.org/10.1109/TVCG.2014.2346481","authors":"Dominik Sacha, Andreas Stoffel, Florian Stoffel, Bum Chul Kwon, Geoffrey P. Ellis, Daniel A. Keim","award_1":"10 Year","award_2":"Test of Time Award","citation":"","extra_1":"Presented for the","extra_2":"IEEE VAST 2014 Paper","paper":"Knowledge Generation Model for Visual Analytics"},{"Award":"IEEE InfoVis Test of Time Award 2024 (1 of 2)","DOI":"https://doi.org/10.1109/INFVIS.2004.1","authors":"Mohammad Ghoniem, Jean-Daniel Fekete, and Philippe Castagliola","award_1":"20 Year","award_2":"Test of Time Award","citation":"In their seminal work entitled \"A Comparison of the Readability of Graphs Using Node-Link and Matrix-Based Representations\", Mohammad Ghoniem, Jean-Daniel Fekete, and Philippe Castagliola helped to set the stage for empirical work to evaluate readability in graph visualization.  Based on a set of carefully defined, generic tasks, as well as three-times-three synthetic test graphs, they compared an adjecency matrix based visualization to the omni-present node-link diagram with a spring-embedder layout.  Finding arguments for both visualization approaches, depending on the task at hand, this work has resulted in long-lasting impact on related visualization research in the last 20 years, comprising an important early milestone upon which a large number of important follow-up studies have been conducted.","extra_1":"Presented for the","extra_2":"IEEE INFOVIS 2004 Paper","paper":"A Comparison of the Readability of Graphs Using Node-Link and Matrix-Based Representations"},{"Award":"IEEE InfoVis Test of Time Award 2024 (2 of 2)","DOI":"https://doi.org/10.1109/TVCG.2014.2346248","authors":"Alexander Lex, Nils Gehlenborg, Hendrik Strobelt, Romain Vuillemot, and Hanspeter Pfister","award_1":"10 Year","award_2":"Test of Time Award","citation":"Already 10 years ago, Alexander Lex, Nils Gehlenborg, Hendrik Strobelt, Romain Vuillemot, and Hanspeter Pfister contributed \"UpSet: Visualization of Intersecting Sets\" to the IEEE InfoVis community, spawning an extraordinary run of success with their work.  Their approach to represent sets, their intersections and their aggregations in a smart tabular layout, paired with highly effective interaction mechanisms, including means to sort and query the data, got highly appreciated on an impressive scale, also far beyond the realm of visualization research, importantly supported and facilitated by the authors' approach to open science and reproducibility.  This work is one of very few with a large four-digit number of citations of which a large share is found in other fields of science, making use of UpSet for data visualization.  Besides being a wonderful showcase of highly successful visualization research, this work also takes an important place emphasizing the role and potential of interaction in visualization.  ","extra_1":"Presented for the","extra_2":"IEEE INFOVIS 2014 Paper","paper":"UpSet: Visualization of Intersecting Sets"},{"Award":"IEEE SciVis Test of Time Award 2024 (1 of 3)","DOI":"https://doi.org/10.1109/VISUAL.1999.809866","authors":"Ying-Huey Fua, Matthew O. Ward, Elke A. Rundensteiner","award_1":"25 Year","award_2":"Test of Time Award","citation":"","extra_1":"Presented for the","extra_2":"IEEE VIS 1999 Paper","paper":"Hierarchical parallel coordinates for exploration of large datasets"},{"Award":"IEEE SciVis Test of Time Award 2024 (2 of 3)","DOI":"https://doi.org/10.1109/TVCG.2011.248","authors":"Thomas Torsney-Weir;Ahmed Saad;Torsten Möller, Hans-Christian Hege, Britta Weber, Jean-Marc Verbavatz, Steven Bergner","award_1":"13 Year","award_2":"Test of Time Award","citation":"","extra_1":"Presented for the","extra_2":"IEEE SciVis 2011 Paper","paper":"Tuner: Principled Parameter finding for Image Segmentation Algorithms Using Visual Response Surface Exploration"},{"Award":"IEEE SciVis Test of Time Award 2024 (3 of 3)","DOI":"https://doi.org/10.1109/TVCG.2012.217","authors":"Lingyun Yu, Konstantinos Efstathiou, Petra Isenberg, Tobias Isenberg","award_1":"12 Year","award_2":"Test of Time Award","citation":"","extra_1":"Presented for the","extra_2":"IEEE SciVis 2012 Paper","paper":"Efficient Structure-Aware Selection Techniques for 3D Point Cloud Visualizations with 2DOF Input"}]
